## Pandas - Concatenate Beberapa Baris

    Berikut ini cara untuk menggabungkan beberapa baris dengan menggunakan modul pandas.

In [18]:
#memasukan modul yang digunakan 
import pandas as pd

In [19]:
#memasukan data 
data = pd.read_excel("H:/coba1.xlsx")
data

    name    text       date
0  name1     hej 2014-11-01
1  name1      du 2014-11-02
2  name1      aj 2014-12-01
3  name1      oj 2014-12-02
4  name2     fin 2014-11-01
5  name2    katt 2014-11-02
6  name2  mayket 2014-12-01
7  name2    lite 2014-12-02

In [21]:
#menggabungkan baris berdasarkan kolom 1  
#pemisahnya adalah spasi
data.groupby(['name'])['text'].apply(lambda x: ' '.join(x)).reset_index()

    name                  text
0  name1          hej du aj oj
1  name2  fin katt mayket lite

In [24]:
#menggabungkan baris berdasarkan kolom 1  
#pemisahnya adalah koma
data.groupby(['name'])['text'].apply(','.join).reset_index()

    name                  text
0  name1          hej,du,aj,oj
1  name2  fin,katt,mayket,lite

                            ##Semoga Bermanfaat 
                            ##@Raspiani_